/*

	Modified by Chris Losinger for Smaller Animals Software's ImgLib/ImgDLL.
	Esp. RGB->BGR and row order switches. 9/98
*/
#include <stdio.h>
#include <io.h>

/*
	TGADefs.h - Tye and Constant declaration file
	This File defines the Types, and the Constant Values used by the 
	TGAFile Class.

	Created By: Timothy A. Bish
	Created On:	08/18/98
*/

#ifndef TGADEFSH
#define TGADEFSH

#include <windows.h>

#pragma pack(1) // Align the structure on byte boundries...

// Possible Image Types
#define TGA_NOIMAGETYPE    0	// No Image Data Included in Image
#define TGA_MAPRGBTYPE     1	// Colormapped Image Data - No Compression
#define TGA_RAWRGBTYPE     2	// Truecolor Image Data - No Compression
#define TGA_RAWMONOTYPE    3	// Monochrome Image Data - No Compression
#define TGA_MAPENCODETYPE  9	// Colormapped Image Data - Compressed RLE
#define TGA_RAWENCODETYPE  10	// Truecolor Image Data - Compressed RLE
#define TGA_MONOENCODETYPE 11	// Monochrome Image Data - Compressed RLE
// Version Macro
#define TGA_VERSIONONE 1		// Version 1 File Format
#define TGA_VERSIONTWO 2		// Version 2 File Format
// File Read Write Modes
const int GREYSC = 0;			// Image is Greyscale
const int COLOUR = 1;			// Image is Color
const int MAPPED = 2;			// Image has a Color Map
const int RLENCO = 4;			// Image is RLE Encoded

// 18 Byte Sturcture representin the basic definitions of
// the image
typedef struct _aTGAHEADER
{
	BYTE IDLength;			// 00h Size of ID Field
	BYTE ColorMapType;		// 01h Color Map Type
	BYTE ImageType;			// 02h Image Type Code
	WORD CMapStart;			// 03h Color Map Origin
	WORD CMapLength;		// 05h Color Map Length
	BYTE CMapDepth;			// 07h Color Map Depth
	WORD XOffset;			// 08h X origin of Image
	WORD YOffset;			// 0Ah Y origin of Image
	WORD Width;				// 0Ch Width of Image
	WORD Height;			// 0Eh Height of Image
	BYTE PixelDepth;		// 10h Image Pixel Size
	BYTE ImageDescriptor;	// 11h Image Description Byte
} TGAHEADER;

// The footer is 26 Bytes in length and is always at the end of a
// TGA v2.0 file.
typedef struct _aTGAFOOTER
{
	DWORD ExtensionOffset;		// Extension Area Offset
	DWORD DeveloperOffset;		// Developer Directory Offset
	CHAR Signature[18];			// TGA Signature
} TGAFOOTER;

typedef struct _aTGATAG
{
	WORD  TagNumber;		// ID Number of the Tag
	DWORD DataOffset;		// Offset Location of the Tag
	DWORD DataSize;			// Size of the Tag Data in Bytes
} TGATAG;

// The extension area is basically the second header in the TGA v2.0
// file format.
typedef struct _aTGAEXTENSION
{
	WORD  Size;					// Extension Size
	CHAR  AuthorName[41];		// Author Name
	CHAR  AuthorComment[324];	// Author Comment
	WORD  StampMonth;			// Date/Time Stamp: Month
	WORD  StampDay;				// Date/Time Stamp: Day
	WORD  StampYear;			// Date/Time Stamp: Year
	WORD  StampHour;			// Date/Time Stamp: Hour
	WORD  StampMinute;			// Date/Time Stamp: Minute
